##Цель программы: Вычислить сумму заданного бесконечного ряда
##с точностью eps, а также вывессти таблицу промежуточных
##значений с заданным шагом печати
##Автор: Чепиго Дарья, ИУ7-14Б


eps=float(input('Введите точность eps: '))
shag=float(input('Введите шаг печати: '))
x=float(input('Введите значение переменной: '))
m=int(input('Введите максимальное количество итераций: '))
s=1 ##сумма бесконечного ряда
k=1
i=1
n=3
a=-2*x
print('    Номер итерации    |     ','Значение текущего элемента           |','           Значение текущей суммы')
print('------------------------------------------------------------------------------')
while abs(k-a)>eps:
    s=s+a
    k=a
    if (i-1)%shag==0:
        print('{:^20}'.format(i), ' |     ','{15.7g}'.format(a),'                   |     ''{:15.7g}'.format(s))
    a=(((-1*x)**(n-1)))*n
    n+=1
    i+=1
else:
    print('За данное количество итераций не удалось найти сумму бесконечного ряда ')

print('')
print('Cумма заданного ряда с точностью eps=',eps,   '   равна=', '{:<12.7g}'.format(s))