##Автор: Чепиго Дарья ИУ7-14Б
##Цель программы: по заданным координатам точек треугольника вычислить:
##длины его сторон, биссектриссу, проведенную из большего угла
##Проверить является ли треугольник тупоугольным
##Проверить лежит ли произвольно введенная точка этому треугольнику,
##а также вычислить ее расстояние до ближайшей стороны

##Ввод с клавиатуры координат трех точек-вершин треугольника
print('Введите координаты x,y для первой точки А:')
x1 = float(input('x: '))
y1 = float(input('y: '))

print('Введите координаты x,y для второй точки В:')
x2 = float(input('x: '))
y2 = float(input('y: '))

print('Введите координаты x,y для третьей точки С:')
x3 = float(input('x: '))
y3 = float(input('y: '))

##Вычисление длин сторон треугольника с помощью векторного метода
c = ((x2-x1)**2+(y2-y1)**2)**(1/2)
a = ((x2-x3)**2+(y2-y3)**2)**(1/2)
b = ((x1-x3)**2+(y1-y3)**2)**(1/2)

if (c <= a+b) and (a <= b+c ) and (b <= a+c):
    k=1
    ##Вывод значений сторон треугольника
    print('Длина стороны АВ: {:5.5}'.format(c))
    print('Длина стороны BC: {:5.5}'.format(a))
    print('Длина стороны CA: {:5.5}'.format(b))
else:
    k=0
    print('Такого треугольника не существует')

## m- длина наибольшей стороны, так как напротив большей стороны лежит больший угол
## l-длина биссектриссы, а индекс-сторона, к которой она проведена

m = a 
l = ((c*b*(a+b+c)*(b+c-a))**(1/2))/(b+c)
if m <= b:
    m = b
    l = ((a*c*(a+b+c)*(a+c-b))**(1/2))/(a+c)
if m <= c:
    m = c
    l = ((a*b*(a+b+c)*(a+b-c))**(1/2))/(a+b)
   
##Если квадрат большей стороны треугольника больше, чем сумма квадратов двух других сторон,
##то такой треугольник является тупоугольным. Если меньше-остроугольным, а если равен-прямоугольным.
if k==1:
    print('Длина биссектриссы из наибольшего угла равна= {:5.5}'.format(l))
    if m**2 > (a**2+b**2+c**2-m**2):
        print('Треугольник является тупоугольным')
    elif m**2 == a**2+b**2+c**2-m**2:
        print('Треугольник является прямоугольным')
    else:
        print('Треугольник не является тупоугольным')

    ## Ввод координат произвольной точки 
    print('Введите координаты произвольной точки M:')
    x0 = float(input('x: '))
    y0 = float(input('y: '))

    ## Следующие три переменные нужны для векторного вычисления положения точки М,
    ##а также для вычисления ближайшего расстояния от точки М до стороны треугольника

    v1 = (x1-x0)*(y2-y1)-(x2-x1)*(y1-y0)
    v2 = (x2-x0)*(y3-y2)-(x3-x2)*(y2-y0)
    v3 = (x3-x0)*(y1-y3)-(x1-x3)*(y3-y0)

    ##Вычисление расстояний от точки М до сторон треугольника

    h1 = abs(v1/(((x2-x1)**2+(y2-y1)**2)**1/2))
    h3 = abs(v2/(((x1-x3)**2+(y1-y3)**2)**1/2))
    h2 = abs(v3/(((x3-x2)**2+(y3-y2)**2)**1/2))

    p=(a+b+c)/2
    o=0.000001

    ##формула Герона
    if (h1*c+h2*a+h3*b)/2 < (p*(p-a)*(p-b)*(p-c))**1/2+o:
        p=1
    else:
        p=0
        
    ## Находим m-длину наименьшего расстояния от точки М до стороны треугольника
    m = h1
    if m > h2:
        m = h2
    elif m > h3:
       m = h3

    ## Если v1,v2,v3 имеют одинаковый знак, то точка М внутри треугольника
    ## Если одно из этих значений равно 0, то точка М находится на стороне треугольника

    if  p==1:   
        print('Точка M находится внутри треугольника')
        print('Ближайшее расстояние от точки М до стороны треугольника:{:5.5}'.format(m))
    else:
        print('Точка M находится вне треугольника')




    if a==b or a==c or b==c:
        print('Треугольник является равнобедренным')
    else:
        r=abs(a-c)
        n=b
        if abs(b-c)<r:
            r=abs(b-c)
            n=a
        elif abs(a-b)<r:
            r=abs(a-b)
            n=c
    print(r,c)
    






            



