##Автора: Чепиго Дарья ИУ7-14Б
##Цель программы: определить лежит точка внутри бабочки или снаружи
m = 0


while m!=2:
    ##Ввод значений точки
    print('Введите координаты точки')
    x = float(input('x:'))
    y = float(input('y:'))
    
    ##верхняя часть бабочки
    if 1 <= abs(x) <= 9 and y <= (((abs(x)-9)**2)/-8)+8: ## красная и зеленая
        if  y <= 7*((abs(x)-8)**2)+1: ## болотная и синяя
            if y >= ((abs(x)-1)**2)/49: ##фиолетовая и бирюзовая
                m = 1
    ##нижняя часть бабочки            
    if 1 <= abs(x) <= 8 and y <= -4*((abs(x)-1)**2)/49: ##серая и серая
        if  y >= (((abs(x)-5)**2)/3)-7: ##красная и зеленая яркие
            if  y >= -2*((abs(x)-1)**2)-2: ##желтая и синяя
                    m = 1
    ##брюхо бабочки                
    elif 0 <= abs(x) <= 1 and y >= 4*x**2-6 and y <= -4*x**2+2:
        m = 1
    ##усы бабочки    
    elif 0 <= abs(x) <= 2 and y == 1.5*abs(x)+2: 
        m = 1
    if m == 1:
            print('Точка принадлежит бабочке')
    else:
        print('Точка не принадлежит бабочке')
              
